
# Working with SQLite and Python

### This Notebook is a part of my studies for IBM Certification in Data Science Professional

## What I learned:

- With SQLite and Python:

    - Connect DBases 
    - Create DBases 
    - Insert 
    - Select 
    - Update 
    - INNER JOIN 
    - LEFT OUTER JOIN 
    - CROSS JOIN or CARTESIAN JOIN

In [1]:
import sqlite3
engine = sqlite3.connect('sql4.db')

In [2]:
cursor = engine.cursor()

cursor.execute("PRAGMA foreign_keys = ON").fetchall()

### cursor.execute("PRAGMA foreign_keys").fetchall()

[]

### Syntax:
### "CREATE [TEMP | TEMPORARY] TABLE table-name (
### column-def[, column-def]
### [,constraint]);

### column-def:
### name [type] [[CONSTRAINT name] column-constraint]"

In [49]:
sql_create_projects_table = 'CREATE TABLE IF NOT EXISTS projects (\
                                        id integer PRIMARY KEY,\
                                        name text NOT NULL,\
                                        begin_date text,\
                                        end_date text\
                                    )'

In [50]:
sql_create_tasks_table = """CREATE TABLE IF NOT EXISTS tasks (
                                    id integer PRIMARY KEY,
                                    name text NOT NULL,
                                    priority integer,
                                    status_id integer NOT NULL,
                                    project_id integer NOT NULL REFERENCES projects (id),
                                    begin_date text NOT NULL,
                                    end_date text NOT NULL
                                );"""
# StudentId INT REFERENCES Student (StudentId)
#FOREIGN KEY (project_id) REFERENCES projects (id)

In [51]:
cursor.execute(sql_create_projects_table)

In [22]:
cursor.execute(sql_create_tasks_table)

In [7]:
data = cursor.execute("PRAGMA table_info(projects)").fetchall()
for d in data:
    print (d[0], d[1], d[2])

0 id integer
1 name text
2 begin_date text
3 end_date text

In [24]:
data = cursor.execute("PRAGMA table_info(tasks)").fetchall()
for d in data:
    print (d[0], d[1],d[2])

0 id integer
1 name text
2 priority integer
3 status_id integer
4 project_id integer
5 begin_date text
6 end_date text

## SYNTAX (INSERT): 

### "INSERT [OR conflict-algorithm]
### INTO [database-name .] table-name [(column-list)]
### VALUES (value-list)"

In [25]:
cursor.execute("INSERT INTO projects (name,begin_date,end_date) VALUES ('Project03','2021-02-23','2021-03-23')")

In [26]:
engine.commit()

## SYNTAX (SELECT): 

### SELECT [ALL | DISTINCT] result [FROM table-list]
### [WHERE expr]
### [GROUP BY expr-list]
### [HAVING expr]
### [compound-op select]*
### [ORDER BY sort-expr-list]
### [LIMIT integer [(OFFSET|,) integer]]

In [27]:
cursor.execute('SELECT * FROM projects ').fetchall()

[(1, 'Project03', '2021-02-23', '2021-03-23')]

In [29]:
cursor.execute("INSERT INTO tasks (name,priority,status_id,project_id,begin_date,end_date)\
    VALUES ('task05',0,1,10,'2021-02-23','2021-03-23')")

In [30]:
#tasks=[(1,'task01',0,1,0,'2021-02-23','2021-03-23'), (2,'task02',0,1,0,'2021-02-23','2021-03-23')]
#cursor.executemany('INSERT INTO tasks VALUES (?,?,?,?,?,?,?)', tasks)

In [31]:
cursor.execute("SELECT * from tasks").fetchall()

[(1, 'task05', 0, 1, 1, '2021-02-23', '2021-03-23')]

In [3]:
cursor.execute('''CREATE TABLE EMP (EMPNO int, ENAME text, JOB text, MGR int, HIREDATE date, SAL real,COMM int, DEPTNO int)''')

In [4]:
data = cursor.execute("PRAGMA table_info(EMP)").fetchall()
for d in data:
    print (d[0], d[1], d[2])

0 EMPNO int
1 ENAME text
2 JOB text
3 MGR int
4 HIREDATE date
5 SAL real
6 COMM int
7 DEPTNO int

In [5]:
 employes = [(7369, 'SMITH',  'CLERK', 7902, '2005-12-11', 800, 150 , 20),
 (7499, 'ALLEN',  'SALESMAN', 7698, '2006-02-23',1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698,'2006-02-26', 1250, 500, 30),
 (7566, 'JONES','MANAGER', 7839,'2006-04-02', 2975, 520, 20),            
 (7654, 'MARTIN','SALESMAN', 7698,'2006-09-28', 1400, 420, 30),
 (7698, 'BLAKE','MANAGER', 7839,'2006-05-1', 2850, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09',2450, 580,10),
 (7788, 'SCOTT', 'ANALYST', 7566,'2007-12-09',3000,640,20),
 (7839, 'KING','PRESIDENT','', '2006-11-17',5000,0,10),
 (7844, 'TURNER', 'SALESMAN',7698,'2006-09-13',1500,0,30),
 (7876, 'ADAMS', 'CLERK',7788, '2008-01-12',1100,50,20),
 (7900, 'JAMES', 'CLERK',7698, '2006-12-03',950,40,30),
 (7902, 'FORD', 'ANALYST',7566,'2006-12-03',3000,10,20),
 (7934, 'MILLER','CLERK',7782,'2007-01-23',1300,"",10)]

In [6]:
cursor.executemany('INSERT INTO EMP VALUES (?,?,?,?,?,?,?,?)', employes)

In [7]:
cursor.execute('SELECT * FROM EMP').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [8]:
cursor.execute('''CREATE TABLE DEPT
             (DEPTNO int not null, DNAME  text, LOC text)''')

In [9]:
depts = [(10,'ACCOUNTING','NEW YORK'),
         (20,'RESEARCH','DALLAS'),
         (30,'SALES','CHICAGO'),
         (40,'OPERATIONS','BOSTON')]

In [10]:
type(depts)

list

In [11]:
cursor.executemany('INSERT INTO DEPT VALUES (?,?,?)', depts)

In [12]:
cursor.execute('SELECT * FROM DEPT').fetchall()

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [14]:
### SELECT - Filtrando por atributos (Colunas) ##### 

data = cursor.execute('select ename as NAME, job from emp').fetchall()
for x in cursor.description: 
    print(x[0])

NAME
JOB

In [15]:
### Retrieving a Subset of Rows from a Table #### 
cursor.execute('select * from emp where deptno < 30').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [70]:
cursor.execute('select count(deptno) from emp where deptno != 20').fetchall()

[(9,)]

In [71]:
cursor.execute('select DISTINCT job from emp where deptno =20').fetchall()

[('CLERK',), ('MANAGER',), ('ANALYST',)]

In [72]:
cursor.execute('select * from emp where deptno =20').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20)]

### SYNTAX (UPDATE): 

### UPDATE table_name SET column_name=new_value [, ...] WHERE expression

In [73]:
cursor.execute('update emp set sal = sal*1.10 where deptno = 20')
engine.commit()
cursor.execute('select * from emp where deptno =20').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 880.0000000000001, 150, 20),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 3272.5000000000005, 520, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3300.0000000000005, 640, 20),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1210.0, 50, 20),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3300.0000000000005, 10, 20)]

In [34]:
### Using Where #### 
cursor.execute('select ename, job from emp where deptno = 10').fetchall()

[('CLARK', 'MANAGER'), ('KING', 'PRESIDENT'), ('MILLER', 'CLERK')]

In [118]:
### Using Conditional Logic in a SELECT Statement #### 
data = cursor.execute('select ename,sal, case when sal <= 2000 then "UNDERPAID"\
                when sal >= 4000 then "OVERPAID"\
                else "OK" end as status from emp').fetchall()

x = cursor.description
print(x[2][0])

print("Name, Salary, Status")
for d in data: 
    print (d[0], d[1], d[2])
    
#### case when condição (sal <=2000) then faz alguma ação ("UNDERPAID")
###  when outra condição  xxx then uma outra ação 
### else executa última ação
### end fecha a clausla do case

status
Name, Salary, Status
SMITH 880.0000000000001 UNDERPAID
ALLEN 1600.0 UNDERPAID
WARD 1250.0 UNDERPAID
JONES 3272.5000000000005 OK
MARTIN 1400.0 UNDERPAID
BLAKE 2850.0 OK
CLARK 2450.0 OK
SCOTT 3300.0000000000005 OK
KING 5000.0 OVERPAID
TURNER 1500.0 UNDERPAID
ADAMS 1210.0 UNDERPAID
JAMES 950.0 UNDERPAID
FORD 3300.0000000000005 OK
MILLER 1300.0 UNDERPAID

In [45]:
### Limiting the Number of Rows Returned #### 
cursor.execute('select * from emp limit 5').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30)]

In [46]:
### Returning Valores aleatórios #####
cursor.execute('select ename,job from emp order by random() limit 5').fetchall()

[('BLAKE', 'MANAGER'),
 ('MILLER', 'CLERK'),
 ('ALLEN', 'SALESMAN'),
 ('TURNER', 'SALESMAN'),
 ('FORD', 'ANALYST')]

In [23]:
## Searching for Patterns ####
cursor.execute('select ename, job from emp where deptno in (10,20)').fetchall()

[('SMITH', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('SCOTT', 'ANALYST'),
 ('KING', 'PRESIDENT'),
 ('ADAMS', 'CLERK'),
 ('FORD', 'ANALYST'),
 ('MILLER', 'CLERK')]

In [24]:
### Searching for Patterns ###
cursor.execute('select ename, job from emp where deptno in (10,20)\
and (ename like "%I%" or job like "%ER")').fetchall()

[('SMITH', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('KING', 'PRESIDENT'),
 ('MILLER', 'CLERK')]

In [26]:
#### Order by ###
cursor.execute('select ename,job,sal from emp\
    where deptno = 10\
    order by sal asc').fetchall()

[('MILLER', 'CLERK', 1300.0),
 ('CLARK', 'MANAGER', 2450.0),
 ('KING', 'PRESIDENT', 5000.0)]

In [75]:
#### Order By #####
cursor.execute('select empno,deptno,sal,ename,job\
    from emp\
    order by deptno, sal desc').fetchall()

[(7839, 10, 5000.0, 'KING', 'PRESIDENT'),
 (7782, 10, 2450.0, 'CLARK', 'MANAGER'),
 (7934, 10, 1300.0, 'MILLER', 'CLERK'),
 (7788, 20, 3300.0000000000005, 'SCOTT', 'ANALYST'),
 (7902, 20, 3300.0000000000005, 'FORD', 'ANALYST'),
 (7566, 20, 3272.5000000000005, 'JONES', 'MANAGER'),
 (7876, 20, 1210.0, 'ADAMS', 'CLERK'),
 (7369, 20, 880.0000000000001, 'SMITH', 'CLERK'),
 (7698, 30, 2850.0, 'BLAKE', 'MANAGER'),
 (7499, 30, 1600.0, 'ALLEN', 'SALESMAN'),
 (7844, 30, 1500.0, 'TURNER', 'SALESMAN'),
 (7654, 30, 1400.0, 'MARTIN', 'SALESMAN'),
 (7521, 30, 1250.0, 'WARD', 'SALESMAN'),
 (7900, 30, 950.0, 'JAMES', 'CLERK')]

In [ ]:
####  #########

In [169]:
### Relembrando o types dos atributos de cada Tabela

In [24]:
data = cursor.execute('PRAGMA table_info(emp)').fetchall()
data

[(0, 'EMPNO', 'int', 0, None, 0),
 (1, 'ENAME', 'text', 0, None, 0),
 (2, 'JOB', 'text', 0, None, 0),
 (3, 'MGR', 'int', 0, None, 0),
 (4, 'HIREDATE', 'date', 0, None, 0),
 (5, 'SAL', 'real', 0, None, 0),
 (6, 'COMM', 'int', 0, None, 0),
 (7, 'DEPTNO', 'int', 0, None, 0)]

In [27]:
cursor.execute('PRAGMA table_info(dept)')
data = cursor.fetchall()
data

[(0, 'DEPTNO', 'int', 1, None, 0),
 (1, 'DNAME', 'text', 0, None, 0),
 (2, 'LOC', 'text', 0, None, 0)]

In [33]:
#### Realizar alguns SELECTS ##### 
###  Por exemplo Location = New York 
#### ----- #####
sql_select = 'select hiredate from emp where hiredate = "2005-12-11"'
cursor.execute(sql_select).fetchall()

[('2005-12-11',)]

In [35]:
### Achar datas a partir de 2000
sql_select = 'select hiredate from emp where hiredate like "20%"'
cursor.execute(sql_select).fetchall()

[('2005-12-11',),
 ('2006-02-23',),
 ('2006-02-26',),
 ('2006-04-02',),
 ('2006-09-28',),
 ('2006-05-1',),
 ('2006-06-09',),
 ('2007-12-09',),
 ('2006-11-17',),
 ('2006-09-13',),
 ('2008-01-12',),
 ('2006-12-03',),
 ('2006-12-03',),
 ('2007-01-23',)]

In [36]:
#### ORDER BY SUBSTRING ##### 
### substr( string, start, length ) ##### 
cursor.execute('select ename from emp').fetchall()

[('SMITH',),
 ('ALLEN',),
 ('WARD',),
 ('JONES',),
 ('MARTIN',),
 ('BLAKE',),
 ('CLARK',),
 ('SCOTT',),
 ('KING',),
 ('TURNER',),
 ('ADAMS',),
 ('JAMES',),
 ('FORD',),
 ('MILLER',)]

In [42]:
sql_order_by_substring = 'select ename from emp order by ename asc'
cursor.execute(sql_order_by_substring).fetchall()
MS
EN
KE
RK
RD
ES
ES
....

[('ADAMS',),
 ('ALLEN',),
 ('BLAKE',),
 ('CLARK',),
 ('FORD',),
 ('JAMES',),
 ('JONES',),
 ('KING',),
 ('MARTIN',),
 ('MILLER',),
 ('SCOTT',),
 ('SMITH',),
 ('TURNER',),
 ('WARD',)]

In [46]:
### length(str) - retorna o tamanho da string = número de caracteres
### length(Nicolly) = 7 ; lly - substring(Nicolly,5) = lly
sql_order_by_substring = 'select ename from emp order by substr(ename,1,2)'
cursor.execute(sql_order_by_substring).fetchall()

[('ADAMS',),
 ('ALLEN',),
 ('BLAKE',),
 ('CLARK',),
 ('FORD',),
 ('JAMES',),
 ('JONES',),
 ('KING',),
 ('MARTIN',),
 ('MILLER',),
 ('SCOTT',),
 ('SMITH',),
 ('TURNER',),
 ('WARD',)]

In [51]:
#### selecionar nomes terminando com RK ou TH
sql_substr = 'select ename from emp where substr(ename,length(ename)-1)="RK"'
cursor.execute(sql_substr).fetchall()

[('CLARK',)]

In [59]:
#### SELECT 
###. group by using native functions - COUNT and AVG
###  O que quero selecionar (atributos) 
### Por quem quero agrupar 
cursor.execute('select job, count(job) from emp group by job').fetchall()
#sql = 'select job, count(job) from emp

[('ANALYST', 2),
 ('CLERK', 4),
 ('MANAGER', 3),
 ('PRESIDENT', 1),
 ('SALESMAN', 4)]

In [187]:
#### SELECT IN SELECT (SUBQUERIES)
### Usar o resultado de um select como clausula de comparação para outro select

### Quero obter o resultado abaixo, no entanto os atributos são de colunas diferentes

 
ENAME       LOC\
----------  ----------\
CLARK        NEW YORK\
KING         NEW YORK\
MILLER       NEW YORK

In [200]:
### Possível solução ####

In [63]:
### Selecionar todos os infos dos empregados e departamentos - mesmo departamentos_ID
cursor.execute('select * from dept').fetchall()
sql_implicitJoin = 'select * from emp, dept where emp.deptno = dept.deptno'

cursor.execute(sql_implicitJoin)
data = cursor.fetchall()

for row in data: 
    print(row)

(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 20, 'RESEARCH', 'DALLAS')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 30, 'SALES', 'CHICAGO')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 30, 'SALES', 'CHICAGO')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 20, 'RESEARCH', 'DALLAS')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 30, 'SALES', 'CHICAGO')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 30, 'SALES', 'CHICAGO')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 20, 'RESEARCH', 'DALLAS')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 30, 'SALES', 'CHICAGO')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 20, 'RESEARCH', 'DALLAS')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 30, 'SALES', 'CHICAGO')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 20, 'RESEARCH', 'DALLAS')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 10, 'ACCOUNTING', 'NEW YORK')

In [18]:
### Selecionar somente os Nomes dos empregados e os nomes dos departamentos - 
sql_joinEmpDeptNames = 'select e.ename, d.dname from emp e,dept d where e.deptno=d.deptno'
cursor.execute(sql_joinEmpDeptNames).fetchall()

[('SMITH', 'RESEARCH'),
 ('ALLEN', 'SALES'),
 ('WARD', 'SALES'),
 ('JONES', 'RESEARCH'),
 ('MARTIN', 'SALES'),
 ('BLAKE', 'SALES'),
 ('CLARK', 'ACCOUNTING'),
 ('SCOTT', 'RESEARCH'),
 ('KING', 'ACCOUNTING'),
 ('TURNER', 'SALES'),
 ('ADAMS', 'RESEARCH'),
 ('JAMES', 'SALES'),
 ('FORD', 'RESEARCH'),
 ('MILLER', 'ACCOUNTING')]

In [22]:
                            #### INNER JOIN ##### 
###  In SQLite, the INNER JOIN selects all rows from both participating tables 
##   to appear in the result if and only if both tables meet the conditions specified 
##  in the ON clause
## SELECT [result] from Tables [clausla de condicao ou comparacao]
## SELECT [results] from [ 1a Tabela] INNER JOIN [2a Tabela] ON [condicao de JOIN]
sql_inner_join = 'select * from emp as e INNER JOIN dept as d ON e.deptno=d.deptno'
cursor.execute(sql_inner_join)
for row in cursor.fetchall():
    print(row)

(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 20, 'RESEARCH', 'DALLAS')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 30, 'SALES', 'CHICAGO')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 30, 'SALES', 'CHICAGO')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 20, 'RESEARCH', 'DALLAS')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 30, 'SALES', 'CHICAGO')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 30, 'SALES', 'CHICAGO')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 20, 'RESEARCH', 'DALLAS')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 30, 'SALES', 'CHICAGO')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 20, 'RESEARCH', 'DALLAS')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 30, 'SALES', 'CHICAGO')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 20, 'RESEARCH', 'DALLAS')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 10, 'ACCOUNTING', 'NEW YORK')
(7000, 'CHARLES', 'CLERK', 7902, '2005-12-11', 800.0, 150, 40, 40, 'OPERATIONS', 'BOSTON')

In [23]:
### INSERT  PARA TESTAR LEFT OUTER#### 
sql_insert = "insert into emp values(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0)"
cursor.execute(sql_insert)
engine.commit()

In [26]:
cursor.execute('select * from emp where ename ="FLA"').fetchall()

[(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0),
 (7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0)]

In [27]:
                        #### LEFT OUTER JOIN #### 
###  The Left Join or Left Outer Join operation takes two relations, A and B, and returns
###  the inner join of A and B along with the unmatched rows of A
sql_left_join = 'select * from emp as e LEFT JOIN dept as d ON e.deptno=d.deptno'
cursor.execute(sql_left_join)
for row in cursor.fetchall(): 
    print(row)

(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 20, 'RESEARCH', 'DALLAS')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 30, 'SALES', 'CHICAGO')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 30, 'SALES', 'CHICAGO')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 20, 'RESEARCH', 'DALLAS')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 30, 'SALES', 'CHICAGO')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 30, 'SALES', 'CHICAGO')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 20, 'RESEARCH', 'DALLAS')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 30, 'SALES', 'CHICAGO')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 20, 'RESEARCH', 'DALLAS')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 30, 'SALES', 'CHICAGO')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 20, 'RESEARCH', 'DALLAS')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 10, 'ACCOUNTING', 'NEW YORK')
(7000, 'CHARLES', 'CLERK', 7902, '2005-12-11', 800.0, 150, 40, 40, 'OPERATIONS', 'BOSTON')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, None, None, None)
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, None, None, None)

In [30]:
                         #### CROSS JOIN or CARTESIAN JOIN ####     
###  The Cartesian join is one of the fundamental relational operations. 
###  It is a kind of join that results in the combination of all rows from the 
##   first table with all rows in the second.
sql_cross_join = 'select * from emp CROSS JOIN dept'
cursor.execute(sql_cross_join)
for row in cursor.fetchall():
    print(row)

(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 10, 'ACCOUNTING', 'NEW YORK')
(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 20, 'RESEARCH', 'DALLAS')
(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 30, 'SALES', 'CHICAGO')
(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20, 40, 'OPERATIONS', 'BOSTON')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 10, 'ACCOUNTING', 'NEW YORK')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 20, 'RESEARCH', 'DALLAS')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 30, 'SALES', 'CHICAGO')
(7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30, 40, 'OPERATIONS', 'BOSTON')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 10, 'ACCOUNTING', 'NEW YORK')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 20, 'RESEARCH', 'DALLAS')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 30, 'SALES', 'CHICAGO')
(7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30, 40, 'OPERATIONS', 'BOSTON')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 10, 'ACCOUNTING', 'NEW YORK')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 20, 'RESEARCH', 'DALLAS')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 30, 'SALES', 'CHICAGO')
(7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20, 40, 'OPERATIONS', 'BOSTON')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 10, 'ACCOUNTING', 'NEW YORK')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 20, 'RESEARCH', 'DALLAS')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 30, 'SALES', 'CHICAGO')
(7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30, 40, 'OPERATIONS', 'BOSTON')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 10, 'ACCOUNTING', 'NEW YORK')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 20, 'RESEARCH', 'DALLAS')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 30, 'SALES', 'CHICAGO')
(7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30, 40, 'OPERATIONS', 'BOSTON')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 20, 'RESEARCH', 'DALLAS')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 30, 'SALES', 'CHICAGO')
(7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10, 40, 'OPERATIONS', 'BOSTON')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 10, 'ACCOUNTING', 'NEW YORK')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 20, 'RESEARCH', 'DALLAS')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 30, 'SALES', 'CHICAGO')
(7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20, 40, 'OPERATIONS', 'BOSTON')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 10, 'ACCOUNTING', 'NEW YORK')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 20, 'RESEARCH', 'DALLAS')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 30, 'SALES', 'CHICAGO')
(7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10, 40, 'OPERATIONS', 'BOSTON')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 10, 'ACCOUNTING', 'NEW YORK')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 20, 'RESEARCH', 'DALLAS')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 30, 'SALES', 'CHICAGO')
(7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30, 40, 'OPERATIONS', 'BOSTON')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 10, 'ACCOUNTING', 'NEW YORK')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 20, 'RESEARCH', 'DALLAS')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 30, 'SALES', 'CHICAGO')
(7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20, 40, 'OPERATIONS', 'BOSTON')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 10, 'ACCOUNTING', 'NEW YORK')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 20, 'RESEARCH', 'DALLAS')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 30, 'SALES', 'CHICAGO')
(7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30, 40, 'OPERATIONS', 'BOSTON')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 10, 'ACCOUNTING', 'NEW YORK')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 20, 'RESEARCH', 'DALLAS')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 30, 'SALES', 'CHICAGO')
(7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20, 40, 'OPERATIONS', 'BOSTON')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 10, 'ACCOUNTING', 'NEW YORK')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 20, 'RESEARCH', 'DALLAS')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 30, 'SALES', 'CHICAGO')
(7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10, 40, 'OPERATIONS', 'BOSTON')
(7000, 'CHARLES', 'CLERK', 7902, '2005-12-11', 800.0, 150, 40, 10, 'ACCOUNTING', 'NEW YORK')
(7000, 'CHARLES', 'CLERK', 7902, '2005-12-11', 800.0, 150, 40, 20, 'RESEARCH', 'DALLAS')
(7000, 'CHARLES', 'CLERK', 7902, '2005-12-11', 800.0, 150, 40, 30, 'SALES', 'CHICAGO')
(7000, 'CHARLES', 'CLERK', 7902, '2005-12-11', 800.0, 150, 40, 40, 'OPERATIONS', 'BOSTON')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 10, 'ACCOUNTING', 'NEW YORK')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 20, 'RESEARCH', 'DALLAS')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 30, 'SALES', 'CHICAGO')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 40, 'OPERATIONS', 'BOSTON')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 10, 'ACCOUNTING', 'NEW YORK')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 20, 'RESEARCH', 'DALLAS')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 30, 'SALES', 'CHICAGO')
(7000, 'FLA', 'CLERK', 7902, '2005-12-11', 800.0, 150, 0, 40, 'OPERATIONS', 'BOSTON')

EMPNO        RECEIVED          TYPE
 ----------  ----------- ----------
       7369  14-MAR-2005          1
       7900  14-MAR-2005          2
       7788  14-MAR-2005          3

In [31]:
sql_create ='create table emp_bonus(empno int, received date, type int)'
cursor.execute(sql_create)
engine.commit()
cursor.execute('PRAGMA table_info(emp_bonus)').fetchall()

[(0, 'empno', 'int', 0, None, 0),
 (1, 'received', 'date', 0, None, 0),
 (2, 'type', 'int', 0, None, 0)]

In [32]:
bonus_list = [(7369,'02-MAR-2001',1),(7900,'23-MAY-2020',2),(7788,'01-JAN-2010',1)]
sql_insert = 'insert into emp_bonus values(?,?,?)'
cursor.executemany(sql_insert,bonus_list)
engine.commit()
cursor.execute('select * from emp_bonus').fetchall()

[(7369, '02-MAR-2001', 1), (7900, '23-MAY-2020', 2), (7788, '01-JAN-2010', 1)]

In [37]:
sql_multiple_joins = 'select e.ename, d.loc, b.received from emp e\
                        INNER JOIN dept d\
                        ON (e.deptno = d.deptno)\
                        LEFT JOIN emp_bonus b\
                        ON (e.empno = b.empno) order by 2'
cursor.execute(sql_multiple_joins).fetchall()

[('CHARLES', 'BOSTON', None),
 ('ALLEN', 'CHICAGO', None),
 ('WARD', 'CHICAGO', None),
 ('MARTIN', 'CHICAGO', None),
 ('BLAKE', 'CHICAGO', None),
 ('TURNER', 'CHICAGO', None),
 ('JAMES', 'CHICAGO', '23-MAY-2020'),
 ('SMITH', 'DALLAS', '02-MAR-2001'),
 ('JONES', 'DALLAS', None),
 ('SCOTT', 'DALLAS', '01-JAN-2010'),
 ('ADAMS', 'DALLAS', None),
 ('FORD', 'DALLAS', None),
 ('CLARK', 'NEW YORK', None),
 ('KING', 'NEW YORK', None),
 ('MILLER', 'NEW YORK', None)]

ENAME         LOC            RECEIVED
----------  -------------  -----------
ALLEN       CHICAGO
WARD        CHICAGO
MARTIN      CHICAGO
JAMES       CHICAGO        02-MAR-2001
TURNER      CHICAGO
BLAKE       CHICAGO
SMITH       DALLAS         23-MAY-2029
FORD        DALLAS
ADAMS       DALLAS
JONES       DALLAS
SCOTT       DALLAS         01-JAN-2010
CLARK       NEW YORK
KING        NEW YORK
MILLER      NEW YORK

<h2>About the Author:</h2> 

<a href="https://www.linkedin.com/in/wanderson-torres-31049522/">Wanderson Torres</a>